{"title":"Key Account Manager","company":"Nestlé","location":null,"description":"**Position Snapshot**\n**Number of Positions Open:** \n 2\n   \n\n  \n\n**Business area:** \n Nestlé Canada\n   \n\n  \n\n**Location:** \n Brampton, ON; located at 9050 Airport Rd, Brampton, ON L6S 6G9\n   \n\n  \n\n**Hybrid**\n**A Little Bit About Us**\n While Nestlé is known for KitKat, Gerber, Nescafe, and Häagen\\-Dazs, our recipe for success comes down to one thing: our people.\n   \n\n  \n\n We strive to lead a people\\-focused culture that empowers employees to bring their authentic selves to work each day. There are 3,000\\+ members of Nestlé Canada celebrated for taking action using agility, courage, and trust to find solutions that benefit the business or greater good. We’re a team of changemakers, who are curious and challenge the status quo, that take risks that will help drive us forward.\n   \n\n  \n\n Our focus is not only on nourishing our customers, but also about enriching you. We know that empowerment leads to strong employee engagement, a great work culture, and motivated employees.\n   \n\n  \n\n**What to Expect:**\n We are looking for two enthusiastic Key Account Managers to become part of our Head Office team in Brampton, reporting to the Customer Team Leaders. You will analyze market trends, identify opportunities for growth, and develop tailored solutions that resonate with our customers.\n   \n\n  \n\n Both positions will concentrate on analysis of market trends, identify opportunities for growth, and develop tailored solutions that resonate with our customers. One placement on the Nestlé Sobey’s Coffee Category which includes brands like Starbucks® and Nescafé®, while the other will focus on our Nestle Loblaw Imported Waters Category which includes brands like Perrier \\& San Pellegrino.\n   \n\n  \n\n**A day in the life:**\n* Develop and achieve the sales business plan for the business by implementing the strategy, managing total trade spend by category, and achieving agreed shelf, distribution, and promotional targets.\n* Analyse, identify, monitor, and address specific issues to achieve Nestlé’s goals for sales, commercial spend, share, distribution, and operating budgets.\n* Develop and implement trade promotion strategies and tactical plans with the customer.\n* Proactively monitor and update the customer's overall business plan, including managing trade budgets, spending, and volume to achieve all sales objectives versus plan.\n* Enter all relevant customer and category promotion plans into the Customer Management Tool in a timely manner to enable demand planners with their forecasting responsibilities.\n* Drive pre and post promotion evaluation to increase ROI/ROS.\n* Be accountable for the strategic account plan, based on internal objectives, marketing, business development, and shopper marketing plans, as well as external competitive marketplace issues and opportunities.\n* Effectively manage internal and external relationships, meeting the agreed level of customer contact with all involved parties.\n\n\n**What will make you successful?**\n* 5\\+ years within sales and account management, with a proven track record of delivering business results from a Consumer Goods Company\n* Solid hands\\-on experience in an analytical role, previous experience in a financial analysis and planning role an asset\n* Effective communication, negotiation and strong leadership skills are required to express analytics and deliver presentations to various levels within the organization and externally to customers.\n* Proficient in gathering data and storytelling to deliver actionable insights.\n* Advanced computer skills, specifically with MS Word, Excel, and PowerPoint. SAP and Power BI is an asset.\n* Proven ability to manage multiple tasks with excellent time and project management while paying attention to detail.\n* Post secondary education in Business Administration or any related field\n* Motivation as a self\\-starter with the ability to think “out of the box” in an effort to secure incremental business opportunities.\n\n\n**Benefits**\n* Comprehensive total rewards benefits package including Health and Dental benefits that start on day one of employment\n* Company matched pension plan\n* Four weeks of Vacation and five personal days (Personal Paid Holidays)\n* Flexible and hybrid work arrangements\n* Excellent training and development programs as well as opportunities to grow within the company\n* Access to Educational Assistance \\& Tuition Reimbursement\n* Bonus eligibility\n* Gender affirmation benefits to ensure access to necessary care, resources, and coverage for gender\\-affirming procedures\n* Fertility Services and Surrogacy Medical Coverage to support the pursuit of a path to parenthood regardless of medical conditions, gender or sexual orientation\n* Adoption benefits to remove some of the financial barriers associated with adoption\n* Up to 50% off – Nespresso Coffee Machine, Capsules and accessories\n* Access to the Discount Company store with Nestlé, Nespresso, and Purina products (Located across various Nestle offices/sites)\n\n\n**What You Need To Know**\n We will be considering applicants as they apply, so please don’t delay in submitting your application.\n   \n\n  \n\n Nestlé Canada is an equal\\-opportunity employer committed to diversity, equity, inclusion, and accessibility. We welcome qualified applicants to bring their diverse and unique experiences as a result of their education, perspectives, culture, ethnicity, race, sex, gender identity and expression, nation of origin, age, languages spoken, veteran’s status, colour, religion, disability, sexual orientation and beliefs.\n   \n\n  \n\n If you are selected to participate in the recruitment process, please inform Human Resources of any accommodations you may require. Nestlé will work with you in an effort to ensure that you are able to fully participate in the process.\n   \n\n  \n\n \\#NestleSJ","jobType":"fulltime","companyIndustry":"Food and Beverage Services","skills":"","experience_range":"","job_level":"","job_function":"","company_description":""}