{"title":"Entrepreneur in Residence (Future CEO / Founder)","company":"FutureSight","location":null,"description":"FutureSight is seeking an experienced and visionary entrepreneur to co\\-found their next B2B SaaS startup with us.\n   \n\n  \n\n FutureSight is a leading venture studio that co\\-creates world\\-class software companies with values\\-driven entrepreneurs from inception to exit. We are a team of founders, operators and designers with experience successfully bringing software to market at scale.\n   \n\n  \n\n You'll work closely with John Carbrey, a 4x entrepreneur who has experience across several verticals in B2B SaaS and bootstrapped his past venture from 0 to $100M in ARR.\n   \n\n  \n\n You'll also work closely with some of our other leaders, including Joshua, a seasoned CFO and strategic advisor who has taken tech companies to exit with a value of over $200M; Kevin, a product leader who specializes in taking companies successfully from 0 to 1 and beyond; Alan, a world recognized expert in early stage idea validation with 5 books selling 3 million copies, 24 product/services launched, and an exit; and Prathna, an active early stage investor and strategic advisor to founders on capital strategy, growth and team development.\n   \n\n  \n\n What we bring to the table\n   \n\n  \n\n* A proven process and playbook\n* We've done this before and made mistakes. We are here to help you avoid them\n* A committed and engaged team\n* From day one, a superstar bench of marketers, designers, and technologists is here to work with you\n* A lifelong partner with capital\n* We'll be your co\\-founder and first investor supporting the growth of the business\n\n\n What you bring to the table\n   \n\n  \n\n* You're motivated to co\\-found a new venture as the CEO\n* With or without us, this is your calling\n* You know what you're signing up for\n* You're familiar with the scrappiness of owning a business from start to finish\n* You understand the role of key stakeholders: customers, talent, and investors\n* You have co\\-founded a company (product company or B2B SaaS venture), have been at a venture\\-backed company or have equivalent intrapreneurial experience\n* You bring relevant domain expertise and/or industry advantage\n* You understand your domain and/or Industry very well, recognize the challenges and are passionate about solving them\n\n\n What you can expect\n   \n\n  \n\n* Daily active engagement with our team\n* Early\\-stage testing, validation, and refinement of business ideas to ensure product\\-market\\-fit\n* Be prepared for us to kill many ideas with you before we get to the silver bullet\n* Create prototypes to help validate and sell potential solutions\n* For validated opportunities, launch an initial product, achieve initial market traction, prepare for pre\\-seed, and seed fundraise\n* You will be building:\n* A team, a product, a revenue model, a business and an investor base\n* Ownership\n* You will own the P/L of the new entity\n* You will have a significant equity stake in the new business\n* This is a full\\-time role. We are looking for someone to commit full\\-time and exclusively to building and owning a new SaaS venture\n\n\n To be considered\n   \n\n  \n\n If this is the perfect opportunity for you, we want to hear from you!\n   \n\n  \n\n Submit your Resume and LinkedIn profile and tell us more about why you think we should chat!\n   \n\n  \n\n**Requirements**\n* Ready to commit full\\-time and exclusively to an entrepreneurial journey\n* Have the risk appetite and capacity. Read more on our post on the Entrepreneurial Risk Profile\n* Relevant domain expertise and/or industry advantage, understand your domain and/or industry and are passionate to solve the challenges in your domain and/or industry\n* Have previous experience co\\-founding and leading an early\\-stage company (product company or B2B SaaS venture) or have equivalent intrapreneurial experience\n* Desire to be a venture\\-backed co\\-founder\n* Generalist with solid skills in a key startup discipline (sales, tech, product, design, marketing, etc.)\n* Experience pitching to investors and raising capital","jobType":"fulltime","companyIndustry":"IT Services and IT Consulting","skills":"","experience_range":"","job_level":"","job_function":"","company_description":""}