{"title":"Analyst - Specialized Finance","company":"EQ Bank | Equitable Bank","location":null,"description":"**Join a Challenger**\n Being a traditional bank just isn’t our thing. We are big believers in innovating the banking experience because we believe Canadians deserve better options, and we challenge ourselves and our teams to creatively transform what’s possible in banking. Our team is made up of inquisitive and agile minds that find smarter ways of doing things. If you’re not afraid of taking on big challenges and redefining the future, you belong with us. You’ll get to work with people who will encourage you to reach new heights. We like to keep things fun, ask questions and learn together.\n   \n\n  \n\n We are a big (and growing!) family. Overall we serve more than 670,000 people across Canada through Equitable Bank, Canada's Challenger Bank™, and have been around for more than 50 years. Equitable Bank's wholly\\-owned subsidiary, Concentra Bank, supports credit unions across Canada that serve more than six million members. Together we have over $125 billion in combined assets under management and administration, with a clear mandate to drive change in Canadian banking to enrich people's lives. Our customers have named our EQ Bank digital platform (eqbank.ca) one of the top banks in Canada on the Forbes World's Best Banks list since 2021\\.\n   \n\n  \n\n**The Work**\n While adhering to established compliance and control requirements, the Analyst, Specialized Finance will be responsible for portfolio administration and writing credit risk analyses while assisting with the development, structuring and overall management of the Bank’s specialized commercial lending platform. The key focus will be placed on real estate and non\\-real estate secured operating lines of credit, equipment financing, portfolio acquisitions, “lend\\-to\\-lender” financing and other new opportunities across a diverse range of industries. Along with the other Analyst, the incumbent will assist in obtaining buy\\-in from Management on new deals, structures and asset classes. The analyst will also perform and learn financial analysis, modeling and valuation, co\\-ordinate and collaborate with internal teams to perform diligence activities and prepare presentation materials as required.\n   \n\n  \n\n The Analyst will need to ensure that key policies, controls and processes are followed such that all relevant Bank stakeholders are involved with, and apprised of, new deal flow, operational requirements, and funding/reconciliation mechanics. Without limitation, Corporate Development, Accounting, Treasury, Finance, Payments, Commercial Funding and Credit will need to be actively engaged to ensure smooth loan fulfillment while minimizing operational and credit risk. The Analyst will complete ongoing portfolio management including, but not limited to, monthly, quarterly, and annual reporting requirements, in order to effectively manage exposure and prudently monitor risk associated with new and existing investments.\n   \n\n  \n\n**Portfolio monitoring and stakeholder management (65%)**\n* Prepare reports for Management and ultimately monitor funded specialized finance deals including analysis of borrowing base and margin requirements, covenants, operating line usage, portfolio amortization and key risks.\n* Develop familiarity with internal systems and gather relevant data from various internal sources.\n* Monitor and maintain control mechanisms and standardized reporting documents which prudently monitor risk.\n* Ensure internal Bank stakeholders are appropriately consulted during deal origination and thereafter to ensure amicable and cohesive relationships.\n* Stay current on recent events and share findings with related Bank parties as necessary\n\n\n**Credit risk analysis (30%)**\n* Prepare credit risk analyses on large transactions (typically $25\\.0 million\\+), primarily annual reviews.\n* Perform and learn financial analysis, modeling and valuation.\n* Prepare presentation materials as required.\n* Support the development of business cases for new opportunities – manage the communication of findings and support on follow\\-up.\n* Use and learn quantitative methods (e.g., Excel models) to develop insights that support decision making.\n* Ensure compliance with the Bank’s established AML policies, lending guidelines and procedures.\n* Ensure all lending criteria and outstanding documentation/conditions have been satisfied on all transactions, while being processed in a timely and efficient manner to deliver superior customer service.\n\n\n**Business development and research (5%)**\n* Along with the Director, Specialized Finance, participates in the development of new relationships and referral sources with the aim of identifying new and profitable lending opportunities.\n* Contribute to the brainstorming, structuring and problem\\-solving process for new lending opportunities including market research to support business unit and enterprise strategy.\n* Scan various sources (e.g., news releases, journals, industry publications, etc.) to identify, track and monitor market, competitive and regulatory trends.\n* Perform interviews with internal and external parties to gather information and develop insights\n\n\n**Let's Talk About You!**\n* Post\\-secondary education (diploma/degree) in Business Commerce or related field.\n* 1\\-3 years’ experience in commercial and/or corporate lending. Experience in both real estate and specialized lending is considered an asset\n* Strong business acumen.\n* Excellent financial, analytical, and problem\\-solving skills\n* Excellent oral and written communication skills as well as attention to detail.\n* Proficient in using MS Office (Excel, Access, Power Point).\n* Proven ability to thrive in a constantly changing environment and to perform well in a high volume, high intensity environment.\n* Ability to handle multiple competing priorities.\n* CFA is an asset\n\n\n**What we offer \\[For full\\-time permanent roles]**\n 💰 Competitive discretionary bonus\n   \n\n  \n\n ✨ Market leading RRSP match program\n   \n\n  \n\n 🩺 Medical, dental, vision, life, and disability benefits\n   \n\n  \n\n 📝 Employee Share Purchase Plan\n   \n\n  \n\n 👶🏽 Maternity/Parental top\\-up while you care for your little one\n   \n\n  \n\n 🏝 Generous vacation policy and personal days\n   \n\n  \n\n 🖥 Virtual events to connect with your fellow colleagues\n   \n\n  \n\n 🎓 Annual professional development allowance and a comprehensive Career Development program\n   \n\n  \n\n 💛 A fulfilling opportunity to join one of the top FinTechs and help create a new kind of banking experience\n   \n\n  \n\n Equitable Bank is deeply committed to inclusion. Our organization is stronger and our employees thrive when we honour and celebrate everyone’s diverse experiences and perspectives. In tandem with that commitment, we support and encourage our staff to grow not just in their career path, but personally as well.\n   \n\n  \n\n We commit to providing a barrier\\-free recruitment process and work environment for all applicants. Please let us know of any accommodations needed so that you can bring your best self to the application process and beyond. All candidates considered for hire must successfully pass a criminal background check and credit check to qualify for hire. While we appreciate your interest in applying, an Equitable recruiter will only contact leading candidates whose skills and qualifications closely match the requirements of the position.\n   \n\n  \n\n We can’t wait to get to know you!","jobType":"fulltime","companyIndustry":"Transportation, Logistics, Supply Chain and Storage","skills":"","experience_range":"","job_level":"","job_function":"","company_description":""}